# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [10]:
query_string = '''
SELECT e.lastName, e.firstName, o.city
FROM offices o
JOIN employees e
ON e.officeCode = o.officeCode
WHERE o.city LIKE '%Boston'
'''

result = cur.execute(query_string)
res_df = pd.DataFrame(result.fetchall()) # Take results and create data frame
res_df.columns = [i[0] for i in cur.description] # creates a list of column names using the description attribute of the cursor
res_df

    lastName firstName    city
0   Firrelli     Julie  Boston
1  Patterson     Steve  Boston

## Do any offices have no employees?

In [14]:
query_string = '''
SELECT o.city, count(e.employeeNumber) as freq
FROM offices o
JOIN employees e
ON o.officeCode = e.OfficeCode
GROUP BY o.city
'''

result = cur.execute(query_string)
res_df = pd.DataFrame(result.fetchall()) # Take results and create data frame
res_df.columns = [i[0] for i in cur.description] # creates a list of column names using the description attribute of the cursor
res_df

            city  freq
0         Boston     2
1         London     2
2            NYC     2
3          Paris     5
4  San Francisco     6
5         Sydney     4
6          Tokyo     2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [16]:
query_string = '''
SELECT e.lastName, e.firstName, p.productName
FROM products p 
JOIN orderdetails od
ON p.productCode = od.productCode 
JOIN orders ord
ON od.orderNumber = ord.orderNumber
JOIN customers c
ON ord.customerNumber = c.customerNumber
JOIN employees e
ON c.salesRepEmployeeNumber = e.employeeNumber
'''

result = cur.execute(query_string)
res_df = pd.DataFrame(result.fetchall()) # Take results and create data frame
res_df.columns = [i[0] for i in cur.description] # creates a list of column names using the description attribute of the cursor
res_df

       lastName firstName                            productName
0        Vanauf    George  1969 Harley Davidson Ultimate Chopper
1        Bondur      Loui  1969 Harley Davidson Ultimate Chopper
2        Bondur      Loui  1969 Harley Davidson Ultimate Chopper
3      Thompson    Leslie  1969 Harley Davidson Ultimate Chopper
4      Jennings    Leslie  1969 Harley Davidson Ultimate Chopper
5      Jennings    Leslie  1969 Harley Davidson Ultimate Chopper
6     Hernandez    Gerard  1969 Harley Davidson Ultimate Chopper
7         Jones     Barry  1969 Harley Davidson Ultimate Chopper
8      Jennings    Leslie  1969 Harley Davidson Ultimate Chopper
9        Bondur      Loui  1969 Harley Davidson Ultimate Chopper
10       Fixter      Andy  1969 Harley Davidson Ultimate Chopper
11        Tseng  Foon Yue  1969 Harley Davidson Ultimate Chopper
12       Vanauf    George  1969 Harley Davidson Ultimate Chopper
13       Vanauf    George  1969 Harley Davidson Ultimate Chopper
14    Hernandez    Gerard  1969 Harley Davidson Ultimate Chopper
15    Patterson     Steve  1969 Harley Davidson Ultimate Chopper
16         Bott     Larry  1969 Harley Davidson Ultimate Chopper
17        Jones     Barry  1969 Harley Davidson Ultimate Chopper
18    Patterson     Steve  1969 Harley Davidson Ultimate Chopper
19       Vanauf    George  1969 Harley Davidson Ultimate Chopper
20     Castillo    Pamela  1969 Harley Davidson Ultimate Chopper
21        Marsh     Peter  1969 Harley Davidson Ultimate Chopper
22       Fixter      Andy  1969 Harley Davidson Ultimate Chopper
23    Hernandez    Gerard  1969 Harley Davidson Ultimate Chopper
24    Patterson     Steve  1969 Harley Davidson Ultimate Chopper
25        Marsh     Peter  1969 Harley Davidson Ultimate Chopper
26         Bott     Larry  1969 Harley Davidson Ultimate Chopper
27    Hernandez    Gerard  1969 Harley Davidson Ultimate Chopper
28        Jones     Barry               1952 Alpine Renault 1300
29        Jones     Barry               1952 Alpine Renault 1300
...         ...       ...                                    ...
2966     Bondur      Loui                       Boeing X-32A JSF
2967   Jennings    Leslie                       Boeing X-32A JSF
2968     Fixter      Andy                       Boeing X-32A JSF
2969   Castillo    Pamela                             Pont Yacht
2970      Nishi      Mami                             Pont Yacht
2971       Bott     Larry                             Pont Yacht
2972   Jennings    Leslie                             Pont Yacht
2973  Hernandez    Gerard                             Pont Yacht
2974      Jones     Barry                             Pont Yacht
2975     Gerard    Martin                             Pont Yacht
2976   Firrelli     Julie                             Pont Yacht
2977     Gerard    Martin                             Pont Yacht
2978     Bondur      Loui                             Pont Yacht
2979   Thompson    Leslie                             Pont Yacht
2980       Bott     Larry                             Pont Yacht
2981     Vanauf    George                             Pont Yacht
2982      Tseng  Foon Yue                             Pont Yacht
2983   Castillo    Pamela                             Pont Yacht
2984     Vanauf    George                             Pont Yacht
2985   Castillo    Pamela                             Pont Yacht
2986       Bott     Larry                             Pont Yacht
2987  Hernandez    Gerard                             Pont Yacht
2988   Castillo    Pamela                             Pont Yacht
2989      Tseng  Foon Yue                             Pont Yacht
2990  Hernandez    Gerard                             Pont Yacht
2991      Marsh     Peter                             Pont Yacht
2992       Bott     Larry                             Pont Yacht
2993  Hernandez    Gerard                             Pont Yacht
2994  Hernandez    Gerard                             Pont Yacht
2995  Patterson     Steve                             Pont Yacht

[2996 rows x 3 columns]

## Level Up: Display the Number of Products each Employee Has sold

In [18]:
query_string = '''
SELECT e.employeeNumer, p.productName, count(p.productName) as freq
FROM products p 
JOIN orderdetails od
ON p.productCode = od.productCode 
JOIN orders ord
ON od.orderNumber = ord.orderNumber
JOIN customers c
ON ord.customerNumber = c.customerNumber
JOIN employees e
ON c.salesRepEmployeeNumber = e.employeeNumber
GROUP BY e.employeeNumber, p.productName
'''

result = cur.execute(query_string)
res_df = pd.DataFrame(result.fetchall()) # Take results and create data frame
res_df.columns = [i[0] for i in cur.description] # creates a list of column names using the description attribute of the cursor
res_df

OperationalError: no such column: e.employeeNumer

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!